/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Toimintoa ei voida suorittaa loppuun";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Yritä myöhemmin uudelleen.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "Tätä mediamuotoa ei tueta.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "Media saattaa olla vahingoittunut.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "Ohjelma ei ole valtuutettu toistamaan tätä tiedostoa."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "Mediaa ei voida käyttää.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Ei voida purkaa";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "Tälle medialle tarvittava purkaja on varattu.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Pysäytä muut toiminnot, jotka purkavat mediaa, ja yritä uudelleen.";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorIncompatibleAsset_FailureReason" = "Mediaa ei voida käyttää tällä tietokoneella.";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorNoCompatibleAlternatesForExternalDisplay_FailureReason" = "Sisältöä ei voida toistaa ulkoisella näytöllä.";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorInsufficientContentProtectionConfiguration_FailureReason" = "Suojattua sisältöä ei voida toistaa järjestelmän nykyisellä kokoonpanolla.";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_Description" = "Transkoodauksen tulosvideoraidan kehysten määrä on virheellinen";
"AVFoundationCFErrorDomain_AVCFErrorTranscodeFrameMismatch_FailureReason" = "Transkoodauksen tuloskehysten määrä ei ole sama kuin lähteen, jossa ei ole muokkaussegmenttejä";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_Description" = "Koodauksen purkaminen epäonnistui";
"AVFoundationCFErrorDomain_AVCFErrorDecodeFailed_FailureReason" = "koodauksen purkaja kohtasi virheen";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_Description" = "Koodaus epäonnistui";
"AVFoundationCFErrorDomain_AVCFErrorEncodeFailed_FailureReason" = "koodaaja kohtasi virheen";
"AVFoundationCFErrorDomain_AVCFErrorInvalidPersistentKey_Description" = "Annettu offline-avain on virheellinen";
"AVFoundationCFErrorDomain_AVCFErrorInvalidPersistentKey_FailureReason" = "Annettu offline-avain saattaa olla virheellinen tai pysyvien avainten tallennushakemistoa ei löydy";
"AVFoundationCFErrorDomain_AVCFErrorContentIsNotAuthorized_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorContentIsNotAuthorized_FailureReason" = "Tätä tietokonetta ei ole valtuutettu toistamaan tätä sisältöä";
"AVFoundationCFErrorDomain_AVCFErrorApplicationIsNotAuthorized_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorApplicationIsNotAuthorized_FailureReason" = "Appi ei ole valtuutettu toistamaan suojattua sisältöä";
"AVFoundationCFErrorDomain_AVCFErrorContentIsUnavailable_Description" = "Ei voida avata";
"AVFoundationCFErrorDomain_AVCFErrorContentIsUnavailable_FailureReason" = "Tämä sisältö ei ole enää saatavilla";
